soapRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sen="http://www.example.org/SendJMS">
   <soapenv:Header/>
   <soapenv:Body>
      <sen:sendJMSMessage>
         <sen:messageContent>?</sen:messageContent>
      </sen:sendJMSMessage>
   </soapenv:Body>
</soapenv:Envelope>